using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace LeagueHistory
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void label1_Click(object sender, EventArgs e)
        {

        }

        private void button1_Click(object sender, EventArgs e)
        {
            richTextBox1.Text = "Винаги е имало такива в Ноксус, които не са били съгласни с злините, извършени от Ноксийското високо командване. Върховното командване току - що бе отказало опит за преврат от самопровъзгласилия се престолонаследник Рашалион и се предприе репресия срещу всяка форма на несъгласие срещу новото правителство. Тези политически и социални изгонници, известни като „Сив орден“, се стремяха да оставят съседите си в мир, докато преследваха тъмни тайнствени знания.Лидерите на това изгонено общество бяха семейна двойка: Григори Хастур, Сивият калпак и съпругата му Амолин, Вещицата в сянката.Заедно те водиха изселване на магьосници и друга интелигенция от Ноксус, преселвайки своите последователи отвъд Голямата бариера към северните течения на непростимите земи Вуду.Макар оцеляването да беше предизвикателство на моменти, колонията на Сивия орден успя да процъфти в земя, в която толкова много други щяха да се провалят.Години след изселването Грегори и Амолин имаха дете: Ани.Рано родителите на Ани знаеха, че има нещо особено в дъщеря им.На двегодишна възраст Ани по чудо приковала мечка в сянка -свиреп обитател на вкаменелите гори извън колонията -превръщайки я в своя домашен любимец.И до ден - днешен тя държи на себе си своята мечка Command-Tibbers 'Tibbers', като често го държи заплетена като пълнена кукла Summon - Tibbers, която да се носи като детска играчка.Комбинацията от родовата линия на Ани и тъмната магия на нейното родно място са дали на това момиченце огромна тайнствена сила Пиромания";
        }

        private void button2_Click(object sender, EventArgs e)
        {
            richTextBox1.Text = "Един от древните профили на Darkin Darkin, Aatrox някога е бил безгрижен майстор на мечовете, който се открояваше в кървавия хаос на бойното поле. Заловен в собственото си острие от магията на враговете си, той изчаква хилядолетия подходящ домакин, който да го владее - този смъртен воин е покварен и трансформиран от живото оръжие, а Аатрокс се е преродил. Въпреки че приказките за мрака сега са се превърнали в легенда, той помни твърде добре унищожаването на своята раса и измъчва отмъщението си по един меч в един момент. Атрокс е легендарен воин, един от петте останали от древна раса, известна като Darkin. Той притежава масивното си острие на Blood Price с изящество и пристрастие, прорязвайки се през легиони в стил, който е хипнотичен за гледане. С всеки отпаднал враг, на пръв поглед, живият нож на Aatrox Blood Thirst пие в кръвта им, Blood Well го овластява и подхранва бруталната му, елегантна кампания за клане. Най-ранната приказка за Aatrox е толкова стара, колкото е записана историята. В него се разказва за война между две големи фракции, запомнени единствено като протектората на Blue Team Stag Protectors и профила на Magelords на Red Team Owl. С времето маджолорите спечелиха поредица от смазващи победи, оставяйки ги на ръба да заличат завинаги заклетия си враг. В деня на последната си конфронтация армията на Протекторат се оказа преброена, изтощена и лошо екипирана. Те се подготвиха за неизбежно поражение. Точно когато цялата надежда изглеждаше загубена, Аатрокс се появи сред редиците на Протектората. С няколко думи той призова войниците да се бият до последно, преди да се хвърлят в битка. Присъствието му вдъхнови отчаяните воини. Отначало те можеха само да гледат със страхопочитание как този непознат герой се прокрадва чрез враговете им, тялото и острието му се движат в унисон, сякаш едно същество. Скоро воините се оказаха пропити с мощна жажда за битка. Те последваха Aatrox в битката, като всеки се биеше с яростната си сила от десет, докато не спечели най-малко вероятната победа.";
        }

        private void button3_Click(object sender, EventArgs e)
        {
            richTextBox1.Text = "Изоставена в снежните гори на северна Йония, Ари не знаеше нищо от първоначалното й семейство, освен знака, който са й оставили: чифт съвпадащи скъпоценни камъни. Тя се присъедини към глутница ледени пързалки, докато дебнеха плячка при сутрешния си лов и преди дълго я приеха като своя собствена. Без никой да я научи на магията по рода си, Ари инстинктивно се научи да я черпи от заобикалящия я свят, оформяйки разрушителните сфери на сферата на заблудата и ускорявайки рефлексите си, за да свали плячка. Ако беше достатъчно близо, можеше дори Чар да успокои елен в състояние на спокойствие, дотолкова, че да остане верен, дори и да потъва зъби в плътта му.Ахри за първи път се сблъска с хора, когато войска от чужди войници се разположи на лагер в близост до деня й. Поведението им беше странно за Ари и, любопитна да научи повече, тя ги наблюдаваше отдалеч. Тя беше привлечена особено от ловец, който за разлика от разточителните му спътници използваше всяка част от животните, които е убил, напомняйки й за нейното семейство от лисици.Когато ловецът беше ранен от стрела, Ахри почувства, че животът му пробягва. Тя инстинктивно поглъща същността, напускаща тялото му, и придоби кратки проблясъци от спомените му - любовника, когото е загубил в битка, децата му от непозната земя от желязо и камък. Тя откри, че може да изтласка емоциите му от страх до скръб до радост и го очарова с видения на просмукана от слънце поляна, докато умира.Еуфоричен от стремежа да погълне живота на ловеца, Ахри се почувства по-жив от всякога и обиколи Йония в търсене на повече жертви. Тя с удоволствие си играеше с плячката си, измествайки емоциите си, преди да консумира житейската им същност. Тя се редуваше като ги ослепи с видения за красота, халюцинации на дълбок копнеж и понякога сънища, оцветени от сурова скръб.";
        }

        private void button4_Click(object sender, EventArgs e)
        {
            richTextBox1.Text = "Съществува древен ред с произход от Йонийските острови, посветен на запазването на равновесието. Ред, хаос, светлина, тъмнина - всички неща трябва да съществуват в перфектна хармония, тъй като такъв е пътят на Вселената. Тази заповед е известна като Kinkou и в нея се използва триумвират воини в сянка, за да отстоява своите каузи в света. Акали е един от тези воини в сянка, на който е поверено свещеното задължение за подрязване на дървото - премахване на онези, които заплашват равновесието на Валоран.Блуден артист по бойни изкуства, Акали започна да тренира с майка си веднага щом успее да направи юмрук. Дисциплината на майка й беше неумолима и неумолима, но се основаваше на основния принцип: „Ние правим това, което трябва да се направи“. Когато Kinkou я въведе в реда на четиринайсетгодишна възраст, тя можеше да наряза увиснала верига с котлет на ръката си. Нямаше въпрос - щеше да наследи майка си като Юмрукът на сянката. Тя трябваше да направи много в тази роля, която другите може да се окажат морално съмнителна, но за нея тя е в услуга на неприкосновеното учение на майка й. Сега тя работи с колегите си Shen OriginalSquare Shen и Kennen OriginalSquare Kennen, за да наложат баланса на Valoran.";
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            this.SetDesktopLocation(0, 0);
        }
    }
}
